<a href="https://colab.research.google.com/github/Elena-Lebedeva/SQL_projects/blob/main/SQL_notes.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

from SoloLearn

In [ ]:
INSERT INTO Animals
VALUES ('Slim' ,'Giraffe' ,1);
SELECT Animals.name, Animals.type, Countries.country
FROM Animals, Countries
WHERE Countries.id=Animals.country_id
Order By country;

Your Output
name,type,country Bert,Tiger,India Candy,Elephant,India Vova,Bear,Russia Slim,Giraffe,USA Merlin,Lion,USA Pop,Horse,USA

form Praktikum

In [ ]:
SELECT 
    name, 
    author 
FROM 
    books
WHERE 
    author = 'Эрих Мария Ремарк';--Строки, как в Python, заключают в кавычки

In [ ]:
SELECT
    *
FROM
    название_таблицы
WHERE
    условие_1
    AND условие_2;

--Выбираются строки, которые соответствуют сразу обоим условиям
SELECT
    *
FROM
    название_таблицы
WHERE
    условие_1
    OR условие_2;

--Выбираются строки, которые соответствуют хотя бы одному из условий
SELECT
    *
FROM
    название_таблицы
WHERE
    условие_1
    AND NOT условие_2;

--Выбираются строки, которые соответствуют условию_1 и не соответствуют условию_2

In [ ]:
SELECT
    name,
    author,
    date_pub,
    price
FROM
    books
WHERE
    date_pub > '1990-12-31'
    AND date_pub < '2001-01-01';


/* границы дат в условие не включены, 
чтобы выбрать все дни с 1991 по 2000 годы,
мы взяли последний день 1990 года
и первый день 2001 года */

В отличие от предыдущего кода, границы диапазона в BETWEEN включены в результирующую выборку:

In [ ]:
SELECT
    name,
    pub_name
FROM
    books
WHERE
    pub_name IN ('АСТ', 'ЛитРес', 'Росмэн', 'Эксмо');

In [ ]:
SELECT  
    name, 
    pub_name 
FROM 
    books
WHERE 
    pub_name NOT IN ('АСТ','ЛитРес','Росмэн','Эксмо');

Если в списке должны быть числа, их указывают через запятую: IN (3,7,9). Строки тоже через запятую, но в одинарных кавычках: IN ('значение_1','значение_2','значение_3'). Дату и время обозначают так: IN ('ГГГГ-мм-дд','ГГГГ-мм-дд')

In [ ]:
SELECT
    name,
    price,
    name_store,
    date_upd
FROM
    products_data_all
WHERE
    category = 'молоко и сливки'
    AND
    date_upd IN('2019-06-08', '2019-06-15', '2019-06-22', '2019-06-29');

In [ ]:
SELECT
    COUNT(*) AS cnt
FROM
    products_data_all;

In [ ]:
SELECT
    COUNT(*) AS cnt
FROM
    books
WHERE
    author = 'Эрих Мария Ремарк';

В зависимости от задачи количество строк считают по-разному:
COUNT(*) возвращает общее количество строк в таблице;
COUNT(column) возвращает число строк в столбце column;
COUNT(DISTINCT column) (англ. distinct, «отдельный, особый») возвращает количество уникальных строк в столбце column.

In [ ]:
SELECT
    COUNT(*) AS cnt,
    COUNT(rating) AS author_cnt,
    COUNT(DISTINCT rating) AS author_uniq_cnt
FROM
    books;

In [ ]:
SELECT
    SUM(price) AS summa
FROM
    books;

In [ ]:
SELECT
    AVG(price) AS average
FROM
    books;

In [ ]:
SELECT
    AVG(price) AS average
FROM
    products_data_all
WHERE
    name='Молоко пастеризованное Домик в деревне 2,5%, 930 мл'
    AND name_store='Семёрочка';

In [ ]:
SELECT
    MAX(price)-MIN(price) AS max_min_diff
FROM
    products_data_all
WHERE
    name='Масло топленое Ecotavush 99%, 500 г'
    AND name_store='ВкусМилк';

In [ ]:
Числовые типы данных
integer — целочисленный тип, аналогичный типу int в Python. В PostgreSQL диапазон целых чисел от -2147483648 до 2147483647.
real — число с плавающей точкой, как float в Python. Точность числа типа real до 6 десятичных разрядов.
Строковые типы данных
'Практикум' — значение строкового типа, в SQL запросе его заключают в одинарные кавычки.
varchar(n) — строка переменной длины, где n — ограничение. Этот тип данных похож на string в Python, но в отличие от него ограничен по длине: в поле можно занести любую строку короче, чем n символов.
text — строка любой длины. Полный аналог string в Python.
Дата и время
Любые вводимые значения даты или времени заключают в одинарные кавычки.
timestamp — дата и время. Этот тип аналогичен datetime в Pandas. В формате timestamp чаще всего хранят события, происходящие несколько раз за день. Например, логи пользователей сайта.
date — дата.
Логический
boolean — логический тип данных. В PostgreSQL есть три варианта значений TRUE — «истина», FALSE — «ложь» и NULL — «неизвестно».
Вы изучили распространённые типы данных. Есть и много других. Вы можете познакомиться с ними самостоятельно в документации.

In [ ]:
SELECT
    AVG(pages::integer) AS average
FROM
    books;

SELECT
    AVG(CAST(pages AS integer)) AS average
FROM
    books;

In [ ]:
SELECT
    author,
    COUNT(name) AS cnt
FROM
    books
GROUP BY
    author;

In [ ]:
SELECT
    author,
    rating,
    COUNT(name) AS cnt
FROM
    books
GROUP BY
    author,
    rating;

In [ ]:
SELECT
    author,
    AVG(pages) AS avg_pages,
    MAX(pages) AS max_pages
FROM
    books
GROUP BY
    author;

In [ ]:
SELECT
    name,
    MAX(price) - MIN(price) AS max_min_diff
FROM
    products_data_all
WHERE
    category = 'масло сливочное и маргарин'
    AND date_upd :: date = '2019-06-10'
GROUP BY
    name;

In [ ]:
SELECT
    
    date_upd::date AS update_date,
    category,
    COUNT(category) AS name_cnt
FROM
    products_data_all
WHERE
    date_upd::date='2019-06-05'
GROUP BY
    update_date,
    category    
ORDER BY
    name_cnt;

In [ ]:
SELECT
    
    date_upd::date AS update_date,
    name_store,
    category,
    COUNT(DISTINCT name) AS uniq_name_cnt
FROM
    products_data_all
WHERE
    name_store='Lentro'
    AND date_upd::date='2019-06-30'
GROUP BY
    category,
    update_date,
    name_store
ORDER BY
    uniq_name_cnt DESC;

In [ ]:
SELECT
    name,
    MAX(price) AS max_price
FROM
    products_data_all
GROUP BY
    name
    
ORDER BY
    max_price DESC
LIMIT
5;

In [ ]:
SELECT
    interviews_ft.panelist_id,
    MAX(points_dm.points)
FROM
    interviews_ft 
    INNER JOIN points_dm on points_dm.interview_id = interviews_ft.interview_id
GROUP BY
    interviews_ft.panelist_id
ORDER BY
    points_dm.points DESC
LIMIT 
    3;

In [ ]:
SELECT
    COUNT(panelist_dm.panelist_id),
    AVG(points_dm.interview_id)
    panelist_dm.country
FROM
    interviews_ft 
    INNER JOIN points_dm on points_dm.interview_id = interviews_ft.interview_id
    INNER JOIN panelist_dm on interviews_ft.panelist_id = panelist_dm.panelist_id
GROUP BY
    panelist_dm.panelist_id,
    points_dm.interview_id,
    panelist_dm.country

In [ ]:
SELECT
   AVG (points_dm.interview_id)
FROM
    interviews_ft 
    INNER JOIN points_dm on points_dm.interview_id = interviews_ft.interview_id
GROUP BY
    points_dm.interview_id

In [ ]:
SELECT COUNT(flights.flight_id) AS flights_amount,
       CASE
           WHEN model LIKE 'Airbus%' THEN 'Airbus'
           WHEN model LIKE 'Boeing%' THEN 'Boeing'
           ELSE 'other'
       END AS type_aircraft
FROM aircrafts
INNER JOIN flights ON flights.aircraft_code = aircrafts.aircraft_code
WHERE CAST(flights.departure_time AS date) BETWEEN '2018-09-01' AND '2018-09-30'
GROUP BY type_aircraft;

In [ ]:
SELECT name,
 CASE
  WHEN imdb_rating > 8 THEN 'Fantastic'
  WHEN imdb_rating > 6 THEN 'Poorly Received'
  ELSE 'Avoid at All Costs'
 END AS 'Review'
FROM movies;

% Wildcard
The % wildcard can be used in a LIKE operator pattern to match zero or more unspecified character(s). The given query will match any movie that begins with The, followed by zero or more of any characters.

In [ ]:
SELECT name
FROM movies
WHERE name LIKE 'The%';

_ Wildcard
The _ wildcard can be used in a LIKE operator pattern to match any single unspecified character. The given query will match any movie which begins with a single character, followed by ove.

In [ ]:
SELECT name
FROM movies
WHERE name LIKE '_ove';

In [ ]:
SELECT COUNT(*)

In [ ]:
SELECT SUM(downloads)
FROM fake_apps;

In [ ]:
SELECT ROUND(AVG(price), 2)
FROM fake_apps;

In [ ]:
SELECT price, COUNT(*) 
FROM fake_apps
WHERE downloads > 20000
GROUP BY price;

In [ ]:
SELECT category, 
   price,
   AVG(downloads)
FROM fake_apps
GROUP BY category, price;

In [ ]:
SELECT category, 
   price,
   AVG(downloads)
FROM fake_apps
GROUP BY 1, 2;

In [ ]:
SELECT price, 
   ROUND(AVG(downloads)),
   COUNT(*)
FROM fake_apps
GROUP BY price
HAVING COUNT(*) > 10

In [ ]:
SELECT shirts.shirt_color,
   pants.pants_color
FROM shirts
CROSS JOIN pants;

In [ ]:
SELECT COUNT(DISTINCT user_id) AS 'enrollments',
  COUNT(CASE
       	WHEN strftime("%m", cancel_date) = '03'
        THEN user_id
  END) AS 'march_cancellations',
 	ROUND(100.0 * COUNT(CASE
       	WHEN strftime("%m", cancel_date) = '03'
        THEN user_id
  END) / COUNT(DISTINCT user_id)) AS 'churn_rate'
FROM pro_users
WHERE signup_date < '2017-04-01'
	AND (
    (cancel_date IS NULL) OR
    (cancel_date > '2017-03-01')
  );

In [ ]:
SELECT CASE
   WHEN url LIKE '%github%' THEN 'GitHub'
   WHEN url LIKE '%medium.com%' THEN 'Medium'
   WHEN url LIKE '%nytimes.com%' THEN 'New York Times'
   ELSE 'Other'
  END AS 'Source',
  COUNT(*)
FROM hacker_news
GROUP BY 1;

In [ ]:
SELECT timestamp,
   strftime('%H', timestamp)
FROM hacker_news
GROUP BY 1
LIMIT 20;

This returns the hour, HH, of the timestamp column!

For strftime(__, timestamp):

%Y returns the year (YYYY)
%m returns the month (01-12)
%d returns the day of the month (1-31)
%H returns 24-hour clock (00-23)
%M returns the minute (00-59)
%S returns the seconds (00-59)
if timestamp format is YYYY-MM-DD HH:MM:SS.

In [ ]:
SELECT strftime('%H', timestamp) AS 'Hour',
 ROUND(AVG(score), 2) AS avg_score, 
 COUNT(*) AS 'number of stories'
FROM hacker_news
WHERE timestamp IS NOT NULL
GROUP BY 1
ORDER BY 2 DESC;

In [ ]:
SELECT COUNT(DISTINCT user_id) AS enrollments,
	COUNT(CASE
       	WHEN strftime("%m", cancel_date) = '03'
        THEN user_id
  END) AS march_cancellations,
 	ROUND(100.0 * COUNT(CASE
       	WHEN strftime("%m", cancel_date) = '03'
        THEN user_id
  END) / COUNT(DISTINCT user_id)) AS churn_rate
FROM pro_users
WHERE signup_date < '2017-04-01'
	AND (
    (cancel_date IS NULL) OR
    (cancel_date > '2017-03-01')
  );

In [ ]:
SELECT CASE
   WHEN medium LIKE '%gold%'   THEN 'Gold'
   WHEN medium LIKE '%silver%' THEN 'Silver'
   ELSE NULL
  END AS 'Bling',
  COUNT(*)
FROM met
WHERE Bling IS NOT NULL
GROUP BY 1
ORDER BY 2 DESC;

In [ ]:
 SELECT 
 	premium_users.purchase_date,
  premium_users.cancel_date,
  premium_users.user_id,
  months.months,
  CASE
    WHEN (
      premium_users.purchase_date <= months.months
      )
      AND
      (
        premium_users.cancel_date >= months.months
        OR
        premium_users.cancel_date IS NULL
      )
    THEN 'active'
    ELSE 'not_active'
  END AS 'status'
FROM premium_users
CROSS JOIN months;

In [ ]:
SELECT * 
FROM table1
UNION
SELECT * 
FROM table2;

In [ ]:
WITH play_count AS (
  SELECT song_id,
   COUNT(*) AS 'times_played'
  FROM plays
  GROUP BY song_id
) 
SELECT 
songs.title,
songs.artist,
play_count.times_played
FROM
songs LEFT JOIN play_count
ON play_count.song_id = songs.id
;

In [ ]:
SELECT id, first_name, last_name
FROM book_club
JOIN art_club
  ON book_club.id = art_club.id;
# same but more readable
SELECT id, first_name, last_name
FROM book_club
WHERE id IN (
   SELECT id 
   FROM art_club);

In [ ]:
DELETE FROM drama_students
WHERE id in (
   SELECT id
   FROM band_students
   WHERE grade = 9);

In [ ]:
SELECT * 
FROM drama_students
WHERE grade = (
  SELECT grade
  FROM band_students
  WHERE id = 20);

In [ ]:
SELECT  first_name, last_name
FROM band_students
WHERE id NOT IN (
  SELECT id
  FROM drama_students);

In [ ]:
SELECT grade
FROM band_students
WHERE EXISTS (
   SELECT grade
   FROM drama_students);

In [ ]:
SELECT 
places.name, places.average_rating,
reviews.username, reviews.rating, reviews.review_date, reviews.note
FROM places
left JOIN reviews
ON reviews.place_id = places.id
WHERE reviews.note IS NULL
;

In [ ]:
WITH new_reviews AS 
(SELECT * FROM reviews
WHERE review_date LIKE "2020-%"
)
SELECT 
places.name, places.average_rating,
new_reviews.username, new_reviews.rating, new_reviews.review_date, new_reviews.note
FROM places
INNER JOIN new_reviews
ON new_reviews.place_id = places.id
;

In [ ]:
WITH new_reviews AS 
(SELECT *
from reviews
WHERE strftime("%Y", review_date) = '2020'
)
SELECT 
places.name, places.average_rating,
new_reviews.username, new_reviews.rating, new_reviews.review_date, new_reviews.note
FROM places
INNER JOIN new_reviews
ON new_reviews.place_id = places.id
;

In [ ]:
with low_reviews AS
(
SELECT 
places.name, places.average_rating,
reviews.username, reviews.rating
FROM places
left JOIN reviews
ON reviews.place_id = places.id
WHERE reviews.note IS NOT NULL
AND reviews.rating < average_rating
)
SELECT 
username,
count(username)
FROM low_reviews
GROUP BY username
ORDER BY 2 DESC
;

In [ ]:
SELECT 
  posts.title, 
  subreddits.name AS 'subreddit_name', 
  MAX(posts.score) AS 'highest_score'
FROM posts
INNER JOIN subreddits
  ON posts.subreddit_id = subreddits.id
GROUP BY subreddits.id;

In [ ]:
SELECT 
  subreddits.name, 
  AVG(posts.score) AS 'average_score'
FROM subreddits
inner JOIN posts
  ON posts.subreddit_id = subreddits.id
GROUP BY subreddits.name
ORDER BY 2 DESC;

In [ ]:
SELECT project_name
FROM 
projects  LEFT JOIN employees
ON employees.current_project = projects.project_id
WHERE first_name IS NULL;
# same
SELECT project_name 
FROM projects
WHERE project_id NOT IN (
   SELECT current_project
   FROM employees
   WHERE current_project IS NOT NULL);

In [ ]:
LIMIT 5;

SELECT *
FROM 
projects  LEFT JOIN employees
ON employees.current_project = projects.project_id;

select current_project, count (current_project) from employees
GROUP BY current_project
ORDER BY 2 DESC
LIMIT 1

In [ ]:
SELECT *
FROM 
projects  LEFT JOIN employees
ON employees.current_project = projects.project_id
;

In [ ]:
SELECT project_name, personality
FROM projects
INNER JOIN employees 
  ON projects.project_id = employees.current_project
  WHERE personality = (
   SELECT personality
   FROM employees
   GROUP BY personality
   ORDER BY COUNT(personality) DESC
   LIMIT 1);

In [ ]:
SELECT last_name, first_name, personality, project_name
FROM employees
INNER JOIN projects 
  ON employees.current_project = projects.project_id
WHERE personality = (
   SELECT personality 
   FROM employees
   WHERE current_project IS NOT NULL
   GROUP BY personality
   ORDER BY COUNT(personality) DESC
   LIMIT 1);

In [ ]:
SELECT last_name, first_name, personality, project_name,
CASE 
   WHEN personality = 'INFP' 
   THEN (SELECT COUNT(*)
      FROM employees 
      WHERE personality IN ('ISFP', 'ESFP', 'ISTP', 'ESTP', 'ISFJ', 'ESFJ', 'ISTJ', 'ESTJ'))
   WHEN personality = 'ISFP' 
   THEN (SELECT COUNT(*)
      FROM employees 
      WHERE personality IN ('INFP', 'ENTP', 'INFJ'))
   -- ... etc.
   ELSE 0
END AS 'IMCOMPATS'
FROM employees
LEFT JOIN projects on employees.current_project = projects.project_id;

Funnels

In [ ]:
SELECT question_text,
   COUNT(DISTINCT user_id)
FROM survey_responses
GROUP BY 1;

In [ ]:
SELECT modal_text,
  COUNT(DISTINCT CASE
    WHEN ab_group = 'control' THEN user_id
    END) AS 'control_clicks',
      COUNT(DISTINCT CASE
    WHEN ab_group = 'variant' THEN user_id
    END) AS 'variant_clicks'
FROM onboarding_modals
GROUP BY 1
ORDER BY 1;

In [ ]:
 select * from browse as b
 left join
 checkout as c
 on b.user_id = c.user_id 
 left join purchase as p
 on p.user_id = c.user_id 
 limit 50;

In [ ]:
SELECT DISTINCT b.browse_date,
   b.user_id,
   c.user_id IS NOT NULL AS 'is_checkout',
   p.user_id IS NOT NULL AS 'is_purchase'
FROM browse AS 'b'
LEFT JOIN checkout 'c'
  ON c.user_id = b.user_id
LEFT JOIN purchase 'p'
  ON p.user_id = c.user_id
LIMIT 50;
 ### For review, IS NOT NULL will return:

# 1 (True) if a non-empty value is found
# 0 (False) if a NULL value is found

In [ ]:
WITH funnels AS (
  SELECT DISTINCT b.browse_date,
     b.user_id,
     c.user_id IS NOT NULL AS 'is_checkout',
     p.user_id IS NOT NULL AS 'is_purchase'
  FROM browse AS 'b'
  LEFT JOIN checkout AS 'c'
    ON c.user_id = b.user_id
  LEFT JOIN purchase AS 'p'
    ON p.user_id = c.user_id)
SELECT COUNT (*) AS 'num_browse'
FROM funnels
;

In [ ]:
WITH funnels AS (
  SELECT DISTINCT b.browse_date,
     b.user_id,
     c.user_id IS NOT NULL AS 'is_checkout',
     p.user_id IS NOT NULL AS 'is_purchase'
  FROM browse AS 'b'
  LEFT JOIN checkout AS 'c'
    ON c.user_id = b.user_id
  LEFT JOIN purchase AS 'p'
    ON p.user_id = c.user_id)
SELECT COUNT (*) AS 'num_browse', SUM(is_checkout) AS 'num_checkout', SUM(is_purchase) AS 'num_purchase',
ROUND((1.0 * SUM(is_checkout) / COUNT(user_id)),2) AS 'from browse to checkout',
ROUND((1.0 * SUM(is_purchase) / SUM(is_checkout)),2) AS 'from checkout to purchase'
FROM funnels
;

In [ ]:
WITH funnels AS (
  SELECT DISTINCT b.browse_date,
     b.user_id,
     c.user_id IS NOT NULL AS 'is_checkout',
     p.user_id IS NOT NULL AS 'is_purchase'
  FROM browse AS 'b'
  LEFT JOIN checkout AS 'c'
    ON c.user_id = b.user_id
  LEFT JOIN purchase AS 'p'
    ON p.user_id = c.user_id)
SELECT 
browse_date,
COUNT(*) AS 'num_browse',
   SUM(is_checkout) AS 'num_checkout',
   SUM(is_purchase) AS 'num_purchase',
   1.0 * SUM(is_checkout) / COUNT(user_id) AS 'browse_to_checkout',
   1.0 * SUM(is_purchase) / SUM(is_checkout) AS 'checkout_to_purchase'
FROM funnels
GROUP BY browse_date;

In [ ]:
SELECT DISTINCT quiz.user_id, 
home_try_on.number_of_pairs IS NOT NULL AS 'is_home_try_on',
       CASE
           WHEN home_try_on.number_of_pairs LIKE '3%' THEN 3
           WHEN home_try_on.number_of_pairs LIKE '5%' THEN 5
       END AS is_home_try_on,
purchase.product_id IS NOT NULL AS 'is_purchase'
FROM quiz
LEFT JOIN
home_try_on
ON quiz.user_id = home_try_on.user_id
LEFT JOIN
purchase
ON home_try_on.user_id = purchase.user_id
LIMIT 10;

In [ ]:
WITH enrollments AS
(SELECT *
FROM subscriptions
WHERE subscription_start < '2016-12-01'
AND (
  (subscription_end >= '2016-12-01')
  OR (subscription_end IS NULL)
)),
status AS 
(SELECT
CASE
  WHEN (subscription_end > '2016-12-31')
    OR (subscription_end IS NULL) THEN 0
    ELSE 1
  END as is_canceled,
  CASE
    WHEN subscription_start < '2016-12-01'
      AND (
        (subscription_end >= '2016-12-01')
        OR (subscription_end IS NULL)
      ) THEN 1
    ELSE 0
  END as is_active
  FROM enrollments
  )
SELECT 1.0 * SUM(is_canceled) / SUM(is_active)
FROM status;

In [ ]:
# churn for January
WITH 
enrollments AS
  (
  SELECT *
  FROM subscriptions
  WHERE subscription_start < '2017-01-01'
  AND ( (subscription_end >= '2017-01-01') OR (subscription_end IS NULL))
  ),
status AS 
  (
   SELECT
    CASE
      WHEN (subscription_end > '2017-01-31') OR (subscription_end IS NULL) THEN 0
      ELSE 1
    END as is_canceled,
    CASE
        WHEN subscription_start < '2017-01-01' AND ((subscription_end >= '2017-01-01') OR (subscription_end IS NULL)) THEN 1
        ELSE 0
    END as is_active
  FROM enrollments
  )
SELECT 1.0 * SUM(is_canceled) / SUM(is_active)
FROM status;

In [ ]:
WITH months AS
(SELECT
  '2017-01-01' as first_day,
  '2017-01-31' as last_day
UNION
SELECT
  '2017-02-01' as first_day,
  '2017-02-28' as last_day
UNION
SELECT
  '2017-03-01' as first_day,
  '2017-03-31' as last_day
),
cross_join AS
(SELECT *
FROM subscriptions
CROSS JOIN months),

status AS 
  (
SELECT
id, first_day,
  CASE
        WHEN subscription_start < first_day AND ((subscription_end > first_day) OR (subscription_end IS NULL)) THEN 1
ELSE 0
 END as is_active
  FROM cross_join
  )
SELECT *
FROM status
LIMIT 100;

In [ ]:
WITH months AS
(SELECT
  '2017-01-01' as first_day,
  '2017-01-31' as last_day
UNION
SELECT
  '2017-02-01' as first_day,
  '2017-02-28' as last_day
UNION
SELECT
  '2017-03-01' as first_day,
  '2017-03-31' as last_day
),
cross_join AS
(SELECT *
FROM subscriptions
CROSS JOIN months),
status AS
(SELECT id, first_day as month,
CASE
  WHEN (subscription_start < first_day)
    AND (
      subscription_end > first_day
      OR subscription_end IS NULL
    ) THEN 1
ELSE 0
END as is_active,
CASE
      WHEN subscription_end BETWEEN first_day AND last_day
      THEN 1
      ELSE 0
END as is_canceled
FROM cross_join)
SELECT *
FROM status
LIMIT 100;

In [ ]:
WITH months AS
(SELECT
  '2017-01-01' as first_day,
  '2017-01-31' as last_day
UNION
SELECT
  '2017-02-01' as first_day,
  '2017-02-28' as last_day
UNION
SELECT
  '2017-03-01' as first_day,
  '2017-03-31' as last_day
),
cross_join AS
(SELECT *
FROM subscriptions
CROSS JOIN months),
status AS
(SELECT id, first_day as month,
CASE
  WHEN (subscription_start < first_day)
    AND (
      subscription_end > first_day
      OR subscription_end IS NULL
    ) THEN 1
  ELSE 0
END as is_active,
CASE 
  WHEN subscription_end BETWEEN first_day AND last_day THEN 1
  ELSE 0
END as is_canceled
FROM cross_join),

status_aggregate AS 
( SELECT month, SUM (is_active),SUM (is_canceled)
FROM status
GROUP BY month
)
SELECT *
FROM status_aggregate;

In [ ]:
WITH months AS
(SELECT
  '2017-01-01' as first_day,
  '2017-01-31' as last_day
UNION
SELECT
  '2017-02-01' as first_day,
  '2017-02-28' as last_day
UNION
SELECT
  '2017-03-01' as first_day,
  '2017-03-31' as last_day
),
cross_join AS
(SELECT *
FROM subscriptions
CROSS JOIN months),
status AS
(SELECT id, first_day as month,
CASE
  WHEN (subscription_start < first_day)
    AND (
      subscription_end > first_day
      OR subscription_end IS NULL
    ) THEN 1
  ELSE 0
END as is_active,
CASE 
  WHEN subscription_end BETWEEN first_day AND last_day THEN 1
  ELSE 0
END as is_canceled
FROM cross_join),
status_aggregate AS
(SELECT
  month,
  SUM(is_active) as active,
  SUM(is_canceled) as canceled
FROM status
GROUP BY month)
SELECT month,
1.0*canceled/active AS churn_rate
FROM status_aggregate

In [ ]:
WITH months AS
(SELECT
  '2017-01-01' as first_day,
  '2017-01-31' as last_day
UNION
SELECT
  '2017-02-01' as first_day,
  '2017-02-28' as last_day
UNION
SELECT
  '2017-03-01' as first_day,
  '2017-03-31' as last_day
),
cross_join AS
(SELECT *
FROM subscriptions
CROSS JOIN months),
status AS
(SELECT
  id,
  first_day AS month, 
  CASE
  WHEN (subscription_start < first_day)
    AND (
      subscription_end > first_day
      OR subscription_end IS NULL
    ) 
    AND (segment = '87')
    THEN 1
  ELSE 0
END as is_active_87,
  CASE
  WHEN (subscription_start < first_day)
    AND (
      subscription_end > first_day
      OR subscription_end IS NULL
    ) 
    AND (segment = '30')
    THEN 1
  ELSE 0
END as is_active_30,
CASE 
  WHEN subscription_end BETWEEN first_day AND last_day AND (segment = '30') THEN 1
  ELSE 0
END as is_canceled_30,
CASE 
  WHEN subscription_end BETWEEN first_day AND last_day AND (segment = '87') THEN 1
  ELSE 0
END as is_canceled_87
FROM cross_join),
status_aggregate AS
(SELECT
  month,
  SUM(is_active_87) as active_87, SUM(is_active_30) as active_30,
  SUM(is_canceled_87) as canceled_87, SUM(is_canceled_30) as canceled_30
FROM status
GROUP BY month)
SELECT month,
1.0*canceled_87/active_87 AS churn_rate_87,
1.0*canceled_30/active_30 AS churn_rate_30
FROM status_aggregate

In [ ]:
WITH first_touch AS (
   SELECT user_id,
      MIN(timestamp) AS 'first_touch_at'
   FROM page_visits
   GROUP BY user_id)
SELECT ft.user_id,
  ft.first_touch_at,
  pv.utm_source
FROM first_touch AS 'ft'
JOIN page_visits AS 'pv'
  ON ft.user_id = pv.user_id
  AND ft.first_touch_at = pv.timestamp;

In [ ]:
WITH first_touch AS (
    SELECT user_id,
        MIN(timestamp) as first_touch_at
    FROM page_visits
    GROUP BY user_id)
SELECT ft.user_id,
    ft.first_touch_at,
    pv.utm_source,
		pv.utm_campaign
FROM first_touch ft
JOIN page_visits pv
    ON ft.user_id = pv.user_id
    AND ft.first_touch_at = pv.timestamp;

In [ ]:
WITH first_touch AS
(
  SELECT user_id,
        MIN(timestamp) as first_touch_at
    FROM page_visits
    GROUP BY user_id
    )
SELECT    
		pv.utm_campaign, COUNT (ft.first_touch_at)
FROM first_touch ft
JOIN page_visits pv
    ON ft.user_id = pv.user_id
    AND ft.first_touch_at = pv.timestamp
GROUP BY utm_campaign

In [ ]:
# How many last touches is each campaign responsible for?
WITH last_touch AS
(
  SELECT user_id,
        MAX(timestamp) as last_touch_at
    FROM page_visits
    GROUP BY user_id
    )
SELECT    
		pv.utm_campaign, COUNT (lt.last_touch_at)
FROM last_touch lt
JOIN page_visits pv
    ON lt.user_id = pv.user_id
    AND lt.last_touch_at = pv.timestamp
GROUP BY utm_campaign

In [ ]:
# How many visitors make a purchase?
SELECT COUNT(DISTINCT user_id)
FROM page_visits
WHERE page_name = '4 - purchase'

In [ ]:
# How many last touches on the purchase page is each campaign responsible for?
WITH last_touch AS
(
  SELECT user_id,
        MAX(timestamp) as last_touch_at
    FROM page_visits
    WHERE page_name = '4 - purchase'
    GROUP BY user_id
    )
SELECT    
		pv.utm_campaign, COUNT (lt.last_touch_at)
FROM last_touch lt
JOIN page_visits pv
    ON lt.user_id = pv.user_id
    AND lt.last_touch_at = pv.timestamp
GROUP BY utm_campaign

In [ ]:
# CoolTShirts can re-invest in 5 campaigns. Given your findings in the project, which should they pick and why?
WITH last_touch AS
(
  SELECT user_id,
        MAX(timestamp) as last_touch_at
    FROM page_visits
    WHERE page_name = '4 - purchase'
    GROUP BY user_id
    )
SELECT    
		pv.utm_campaign, COUNT (lt.last_touch_at)
FROM last_touch lt
JOIN page_visSELECT month,
  change_in_followers,
  AVG(change_in_followers) OVER (
    ORDER BY month
  ) AS running_avg
FROM social_media
WHERE username = 'instagram';its pv
    ON lt.user_id = pv.user_id
    AND lt.last_touch_at = pv.timestamp
GROUP BY utm_campaign
ORDER BY COUNT (lt.last_touch_at) DESC
LIMIT 5

Windows functions

In [ ]:
SELECT 
   month,
   change_in_followers,
   SUM(change_in_followers) OVER (
      ORDER BY month
   ) AS 'running_total'
FROM
   social_media
WHERE
   username = 'instagram';

In [ ]:
SELECT month,
  change_in_followers,
  AVG(change_in_followers) OVER (
    ORDER BY month
  ) AS running_avg
FROM social_media
WHERE username = 'instagram';

In [ ]:
SELECT 
   month,
   change_in_followers,
   SUM(change_in_followers) OVER (
      ORDER BY month
   ) AS 'running_total',
   AVG(change_in_followers) OVER (
      ORDER BY month
   ) AS 'running_avg',
   COUNT(change_in_followers) OVER (
      ORDER BY month
   ) AS 'running_count'
FROM
   social_media
WHERE
   username = 'instagram';

In [ ]:
SELECT 
    username,
    month,
    change_in_followers,
    SUM(change_in_followers) OVER (
      PARTITION BY username 
      ORDER BY month
    ) 'running_total_followers_change'
FROM
    social_media;

In [ ]:
SELECT 
    username,
    month,
    change_in_followers,
    SUM(change_in_followers) OVER (
      PARTITION BY username 
      ORDER BY month
    ) 'running_total_followers_change',
    AVG(change_in_followers) OVER (
      PARTITION BY username 
      ORDER BY month
    ) 'running_avg_followers_change'
FROM
    social_media;

In [ ]:
SELECT
   username,
   posts,
   FIRST_VALUE (posts) OVER (
      PARTITION BY username 
      ORDER BY posts
   ) fewest_posts
FROM
   social_media;

In [ ]:
SELECT
   username,
   posts,
   LAST_VALUE (posts) OVER (
      PARTITION BY username 
      ORDER BY posts
      RANGE BETWEEN UNBOUNDED PRECEDING AND 
      UNBOUNDED FOLLOWING
    ) most_posts
FROM
    social_media;

LAG takes up to three arguments:

column (required)
offset (optional, default 1 row offset) default (optional, what to replace default null values with) - so it is '0' to put instead of null, but can be '99'

In [ ]:
SELECT
   artist,
   week,
   streams_millions,
   LAG(streams_millions, 1, 0) OVER (
      ORDER BY week 
   ) previous_week_streams 
FROM
   streams 
WHERE
   artist = 'Lady Gaga';

In [ ]:
SELECT
   artist,
   week,
   streams_millions,
   streams_millions - LAG(streams_millions, 1, streams_millions) OVER ( 
      ORDER BY week 
   ) streams_millions_change
FROM
   streams 
WHERE
   artist = 'Lady Gaga';

In [ ]:
SELECT
   artist,
   week,
   streams_millions,
   streams_millions - LAG(streams_millions, 1, streams_millions) OVER ( 
      PARTITION BY artist
      ORDER BY week 
   ) AS 'streams_millions_change',
   chart_position,
   LAG(chart_position, 1, chart_position) OVER ( 
      PARTITION BY artist
      ORDER BY week 
) - chart_position AS 'chart_position_change'
FROM
   streams
WHERE 
   artist = 'Lady Gaga';

In [ ]:
SELECT
   artist,
   week,
   streams_millions,
   LEAD(streams_millions, 1) OVER (
      PARTITION BY artist
      ORDER BY week
   ) - streams_millions AS 'streams_millions_change'
FROM
   streams;

In [ ]:
SELECT
   artist,
   week,
   streams_millions,
   LEAD(streams_millions, 1) OVER (
      PARTITION BY artist
      ORDER BY week
   ) - streams_millions AS 'streams_millions_change',
   chart_position,
   chart_position -
   LEAD(chart_position, 1) OVER (PARTITION BY artist ORDER BY week) AS 'chart_position_change' 
FROM
   streams;

In [ ]:
SELECT 
   ROW_NUMBER() OVER (
      ORDER BY streams_millions
   ) AS 'row_num', 
   artist, 
   week,
   streams_millions
FROM
   streams;

In [ ]:
SELECT 
   ROW_NUMBER() OVER (
      ORDER BY streams_millions DESC
   ) AS 'row_num', 
   artist, 
   week,
   streams_millions
FROM
   streams;

In [ ]:
# ROW is always sequential while RANK can display equal results as tied.
# RANK - if same value, the rank number will be the same, and nex one is not used (so if 2 7th, next is 9th)
SELECT 
   RANK() OVER (
      ORDER BY streams_millions
   ) AS 'rank', 
   artist, 
   week,
   streams_millions
FROM
   streams;

In [ ]:
SELECT 
   RANK() OVER (PARTITION BY week
      ORDER BY streams_millions DESC
   ) AS 'rank', 
   artist, 
   week,
   streams_millions
FROM
   streams;

NTILE
The last window function we are going to learn is called NTILE and this can be used to find quartiles, quintiles or whatever ntile your data-driven heart desires.

NTILE allows you to break your data into roughly equal groups, based on what ntile you’d like: so if you were using quartile, it would divide the data into four groups (quarters).

When using NTILE you are required to provide a bucket, which represents the number of groups you’d like your data broken down into: NTILE(4) would be four “buckets” which would represent quartiles.

In [ ]:
SELECT 
   NTILE(5) OVER (
      ORDER BY streams_millions DESC
   ) AS 'weekly_streams_group', 
   artist, 
   week,
   streams_millions
FROM
   streams;

In [ ]:
SELECT 
   NTILE(4) OVER (PARTITION BY week
      ORDER BY streams_millions DESC
   ) AS 'weekly_streams_group', 
   artist, 
   week,
   streams_millions
FROM
   streams;

Date and Time Functions I

In [ ]:
SELECT DATETIME('2020-09-01 17:38:22');
SELECT DATETIME('now');
SELECT DATETIME('now', 'localtime');
SELECT DATE('2020-09-01 17:38:22'); -- 2020-09-01
SELECT TIME('2020-09-01 17:38:22'); -- 17:38:22

SELECT DATETIME(timestring, modifier1, modifier2, ...);

The following modifiers can be used to shift the date backwards to a specified part of the date.

start of year: shifts the date to the beginning of the current year.
start of month: shifts the date to the beginning of the current month.
start of day: shifts the date to the beginning of the current day.
For example, the following returns the beginning of September 2005.

In [ ]:
SELECT DATE('2005-09-15', 'start of month'); -- 2005-09-01

The following modifiers add a specified amount to the date and time of the time string.

'+-N years': offsets the year
'+-N months': offsets the month
'+-N days': offsets the day
'+-N hours': offsets the hour
'+-N minutes': offsets the minute
'+-N seconds': offsets the second

In [ ]:
SELECT DATETIME('2020-02-10', 'start of month', '-1 day', '+7 hours'); -- 2020-01-31 07:00:00

For each order in the bakery table, the order will be ready for pick up 2 days after the order is made, at 7:00AM, 7 days a week. The order will always be ready 2 days after the order, no matter what time of day the order was made.

Utilizing the date and time functions and some modifiers, find out when each order can be picked up.

In [ ]:
SELECT DATETIME(order_date, 'start of day', '+2 days', '+7 hours')
FROM bakery;

The STRFTIME() function allows you to return a formatted date, as specified in a format string.

In [ ]:
STRFTIME(format, timestring, modifier1, modifier2, ...)

The first argument, format, is the format string.

The second argument is the timestring.

The remaining arguments are 0 or more optional modifiers to transform the time string.

Let’s go into some more detail about the format string. The format string allows you to extract specific parts of the date and time. Recall the time string format of YYYY-MM-DD HH:MM:SS. Each part of this time string can be extracted utilizing what are known as substitutions inside the format string.

The substitutions to extract each part of the date and time are the following:

%Y returns the year (YYYY)
%m returns the month (01-12)
%d returns the day of month (01-31)
%H returns the hour (00-23)
%M returns the minute (00-59)
%S returns the second (00-59)

In [ ]:
SELECT STRFTIME('%m %Y', 'now'); --11 2022 -- now is 2nd of November 2022
SELECT STRFTIME('%d', 'now'); -- 02

The owners of the bakery want to find out what day most people placed orders.

Use STRFTIME() with the COUNT() function to find out how many orders were made on each day. Show the results in descending order based on the daily number of orders.

In [ ]:
SELECT STRFTIME('%d', order_date), COUNT (STRFTIME('%d', order_date)) 
from bakery
GROUP BY STRFTIME('%d', order_date)
ORDER BY COUNT (STRFTIME('%d', order_date)) DESC

Math operators:

+ Addition
- Subtraction
/ Division
* Multiplication
% Modulo
Math functions:

ABS(): Gives us the absolute value of the input expression

CAST(): Converts the value of an expression into another data type

Date functions:

DATETIME(): Obtains the date and time of a time string

DATE(): Obtains the date portion of a time string

TIME(): Obtains the time portion of a time string

STRFTIME(): Returns a formatted date

Date function modifiers:

Modifiers to shift the date backwards to a specified part:
'start of year'
'start of month'
'start of day'
Modifiers to add a specified amount to the date and time of a time string:
'+-N years'
'+-N months'
'+-N days'
'+-N hours'
'+-N minutes'
'+-N seconds'
Format string substitutions:

%Y returns the year (YYYY)
%m returns the month (01-12)
%d returns the day of month (01-31)
%H returns the hour (00-23)
%M returns the minute (00-59)
%S returns the second (00-59)

et’s start by looking at how the average temperature changes over time in each state.

Write a query that returns the state, year, tempf or tempc, and running_avg_temp (in either Celsius or Fahrenheit) for each state.

(The running_avg_temp should use a window function.)

In [ ]:
SELECT state, year, tempc,
AVG (tempc)
OVER (PARTITION BY state ORDER BY year) running_avg_temp
FROM state_climate

Now let’s explore the lowest temperatures for each state.

Write a query that returns state, year, tempf or tempc, and the lowest temperature (lowest_temp) for each state.

Are the lowest recorded temps for each state more recent or more historic?

In [ ]:
SELECT state, year, tempc,
FIRST_VALUE (tempc)
OVER (PARTITION BY state ORDER BY tempc) lowest_temp
FROM state_climate


Like before, write a query that returns state, year, tempf or tempc, except now we will also return the highest temperature (highest_temp) for each state.

Are the highest recorded temps for each state more recent or more historic?

In [ ]:
SELECT state, year, tempc,
LAST_VALUE (tempc)
OVER (PARTITION BY state ORDER BY tempc RANGE BETWEEN UNBOUNDED PRECEDING AND UNBOUNDED FOLLOWING) highest_temp
FROM state_climate
ORDER BY state, tempc DESC

Let’s see how temperature has changed each year in each state.

Write a query to select the same columns but now you should write a window function that returns the change_in_temp from the previous year (no null values should be returned).

Which states and years saw the largest changes in temperature?
Is there a particular part of the United States that saw the largest yearly changes in temperature?

In [ ]:
SELECT state, year, tempc,
tempc - LAG(tempc, 1, tempc)
OVER (PARTITION BY state ORDER BY year ) change_in_temp
FROM state_climate
ORDER BY change_in_temp DESC

Write a query to return a rank of the coldest temperatures on record (coldest_rank) along with year, state, and tempf or tempc. Are the coldest ranked years recent or historic? The coldest years should be from any state or year. This will require you to use the RANK window function with ORDER BY on tempf or tempc. Because we want to see the overall coldest for any state or year, we do not need to partition the data.

In [ ]:
SELECT state, year, tempc,
RANK()
OVER (ORDER BY tempc) coldest_rank
FROM state_climate

Modify your coldest_rank query to now instead return the warmest_rank for each state, meaning your query should return the warmest temp/year for each state. Again, are the warmest temperatures more recent or historic for each state?

In [ ]:
SELECT state, year, tempc,
RANK()
OVER (PARTITION BY state
  ORDER BY tempc DESC) warmest_rank
FROM state_climate

In [ ]:
# if we only wish to see 1 row with the warmest temperature per state
WITH temp_data AS
(SELECT state, year, tempc,
RANK()
OVER (PARTITION BY state
  ORDER BY tempc DESC) warmest_rank
FROM state_climate) 

SELECT * FROM temp_data
WHERE warmest_rank = 1

Let’s now write a query that will return the average yearly temperatures in quartiles instead of in rankings for each state.

Your query should return quartile, year, state and tempf or tempc. The top quartile should be the coldest years.

Are the coldest years more recent or historic?

In [ ]:
SELECT 
NTILE(4)
OVER (PARTITION BY state ORDER BY tempc) quartile,
year, state, tempc
FROM state_climate

Lastly, we will write a query that will return the average yearly temperatures in quintiles (5).

Your query should return quintile, year, state and tempf or tempc. The top quintile should be the coldest years overall, not by state.

What is different about the coldest quintile now?

In [ ]:
SELECT 
NTILE(5)
OVER (ORDER BY tempc) quintile,
year, state, tempc
FROM state_climate

INTERVIEW PREP PROBLEMS
Coding Challenge 1

Select the title, author, and average_rating of each book with an average_rating between 3.5 and 4.5.

In [ ]:
SELECT 
title, author, 
average_rating
FROM books
WHERE average_rating BETWEEN 3.5 AND 4.5

Select all the unique authors from the table.

In [ ]:
SELECT 
DISTINCT author
FROM books

Given the final scores of several NBA games, use CASE to return the results for each game:

If home team won, return ‘HOME WIN’.
If away team won, return ‘AWAY WIN’.
Select the id column and the CASE result.

In [ ]:
SELECT id,
CASE
WHEN home_points > away_points
THEN 'HOME WIN'
WHEN home_points < away_points
THEN 'AWAY WIN'
END 
FROM nba_matches

The apps table has the following columns:

id - the app id
name - the app name
genre - the genre of the app
rating - the app rating
reviews - the number of reviews
Instructions
1.
Find the number of apps by genre.

In [ ]:
SELECT genre, COUNT (name)
FROM apps
GROUP BY genre

Get the total number of reviews of all apps by genre.

Limit the results for genres where the total number of app reviews is over 30 million.

In [ ]:
SELECT genre, SUM(reviews) 
FROM apps
GROUP BY genre
HAVING SUM(reviews) > 30000000;

Select the name, genre, and rating of apps in descending order of their rating, and limit the result to 20 rows.

In [ ]:
SELECT
name, genre, rating
FROM apps
ORDER BY rating DESC
LIMIT 20

Find the lowest and highest rating for all apps using two different queries.

In [ ]:
SELECT MIN (rating)
FROM apps;
SELECT
MAX (rating)
FROM apps;

Get the average rating of all apps, rounded to 2 decimal places. Alias the result column as ‘average rating’.

In [ ]:
SELECT ROUND (AVG(rating), 2) AS 'average rating'
FROM apps;

The projects table has the following columns:

id - the project id
employee_id - the id of the employee assigned to this project
The employees table has the following columns:

id - the id of the employee
first_name - the first name of the employee
last_name - the last name of the employee

The projects table stores the employee_id for the employee assigned to each project.

Perform an inner join on the two tables, matching on the primary key and foreign key described above, and select all columns.

In [ ]:
SELECT
*
FROM
projects
INNER JOIN
employees
ON projects.employee_id = employees.id

Perform a join between the two tables, such that it selects all projects even if there is no employee assigned to it.

In [ ]:
SELECT
*
FROM
projects
LEFT JOIN
employees
ON projects.employee_id = employees.id;

The math_students and english_students tables have the following columns:

student_id - the student id
grade - the grade level of the student
first_name - the student’s first name
last_name - the student’s last name

In [ ]:
SELECT *
FROM math_students
WHERE student_id IN (
  SELECT student_id
  FROM english_students
);

Using a subquery, find out which students in math are in the same grade level as the student with id 7.

In [ ]:
SELECT *
FROM math_students
WHERE grade IN (
  SELECT grade
  FROM math_students
  WHERE student_id = 7
);

Using a subquery, find all students enrolled in english class who are not also enrolled in math class.

In [ ]:
SELECT *
FROM english_students
WHERE student_id not IN (
  SELECT student_id
  FROM math_students
);

Using a subquery, find out what grade levels are represented in both the math and english classes.

In [ ]:
SELECT grade
FROM math_students
WHERE EXISTS (
  SELECT grade
  FROM english_students
);

The box_office table has the following columns:

id - the id of each row
title - the title of the movie
week - the week following the film’s release
gross - the gross for that week
to_date_gross - the total gross of the movie up to each week
Instructions
1.
Using a window function with PARTITION BY, get the running total in gross for each movie up to the current week and display it next to the current week column along with the title, week, and gross columns.

In [ ]:
SELECT title, week, gross,
SUM(gross) OVER (
      PARTITION BY title 
      ORDER BY week
    ) 'running_total_gross'
FROM  box_office

Write a query using a window function with ROW_NUMBER and ORDER BY to see where each row falls in the amount of gross.

In [ ]:
SELECT ROW_NUMBER()
OVER (
  ORDER BY gross
) AS 'row_num', title, week, gross
FROM box_office;

The orders table has the following columns:

id - the order id
product_id - the product id
price - the price of the individual product item
quantity - the quantity of items in the order

In [ ]:
SELECT id, product_id,
price*quantity
FROM
orders;

The weather table has the following columns:

id - the id of each entry
date - the date of each entry
high - the high temperature of the date, in Fahrenheit
low - the low temperature of the date, in Fahrenheit

In [ ]:
SELECT date,
(CAST(high AS 'REAL') + CAST(low AS 'REAL')) / 2.0 AS 'average'
FROM weather

Code Challenge 13
The purchases table has the following columns:

purchase_id - the id of the purchase
purchase_date - the date of the purchase

In [ ]:
SELECT purchase_id,
DATE(purchase_date, '+7 days')
FROM
purchases;

Get the hour that each purchase was made.

Which hour had the most purchases made?

In [ ]:
SELECT strftime('%H',purchase_date) 
     AS 'Hour',
   COUNT(strftime('%H',purchase_date)) 
     AS 'Purchases'
FROM purchases 
GROUP BY 1 
ORDER BY 2 desc;

Using string formatting and substitutions, get the month and day for each purchase in the form ‘mm-dd’.

Give this new column a name of ‘reformatted’.

In [ ]:
SELECT STRFTIME('%m-%d', purchase_date)
 AS 'reformatted'
FROM purchases ;

For strftime(__, timestamp):

%Y returns the year (YYYY)
%m returns the month (01-12)
%d returns the day of the month (1-31)
%H returns 24-hour clock (00-23)
%M returns the minute (00-59)
%S returns the seconds (00-59)
if time format is YYYY-MM-DD HH:MM:SS.

Project
Twitch is the world’s leading live streaming platform for gamers, with 15 million daily active users. Using data to understand its users and products is one of the main responsibilities of the Twitch Data Science Team.

In this project, you will be working with two tables that contain Twitch users’ stream viewing data and chat room usage data.

Stream viewing data:

stream table
Chat usage data:

chat table
The Twitch Science Team provided this practice dataset. You can download the .csv files (800,000 rows) from GitHub.

Let’s get started!

If you get stuck during this project or would like to see an experienced developer work through it, click Get Unstuck to see a walkthrough video.

In [ ]:
# Start by getting a feel for the stream table and the chat table.
# Select the first 20 rows from each of the two tables.
SELECT * 
FROM stream
LIMIT 20;
SELECT * 
FROM chat
LIMIT 20;

In [ ]:
# What are the unique games in the stream table?
SELECT DISTINCT game 
FROM stream;

In [ ]:
# What are the unique channels in the stream table?
SELECT DISTINCT channel
FROM stream;

In [ ]:
# What are the most popular games in the stream table? 
# Create a list of games and their number of viewers using GROUP BY.
SELECT game, COUNT (*)
FROM stream
GROUP BY 1
ORDER BY 2 DESC;

In [ ]:
# These are some big numbers from the game League of Legends (also known as LoL). Where are these LoL stream viewers located?
# Create a list of countries and their number of LoL viewers using WHERE and GROUP BY.
SELECT country, COUNT (*)
FROM 
stream
WHERE game = 'League of Legends'
GROUP BY 1
ORDER BY 2 DESC

In [ ]:
# The player column contains the source the user is using to view the stream (site, iphone, android, etc).
# Create a list of players and their number of streamers.
SELECT player, COUNT (*)
FROM 
stream
GROUP BY 1
ORDER BY 2 DESC

In [ ]:
# Create a new column named genre for each of the games. Use GROUP BY and ORDER BY to showcase only the unique game titles.

Group the games into their genres: Multiplayer Online Battle Arena (MOBA), First Person Shooter (FPS), Survival, and Other.
SELECT 
       CASE
           WHEN game = 'League of Legends' THEN 'MOBA'
           WHEN game = 'Dota 2' THEN 'MOBA'
           WHEN game = 'Heroes of the Storm' THEN 'MOBA'
           WHEN game = 'Counter-Strike: Global Offensive' THEN 'FPS'
           WHEN game = 'DayZ' THEN 'Survival'
           ELSE 'Other'
       END AS genre,
       COUNT (*)
FROM stream
GROUP BY 1
ORDER BY 2 DESC

In [ ]:
# How does view count change in the course of a day?.
# Before we get started, let’s run this query and take a look at the time column from the stream table:
SELECT time
FROM stream
LIMIT 10;

In [ ]:
# SQLite comes with a strftime() function - a very powerful function that allows you to return a formatted date.
# It takes two arguments:
# strftime(format, column)
# Let’s test this function out:
SELECT time,
strftime('%S', time)
FROM stream
GROUP BY 1
LIMIT 10;

In [ ]:
# Let’s write a query that returns two columns: The hours of the time column and the view count for each hour
# Lastly, filter the result with only the users in your country using a WHERE clause.
SELECT strftime('%H', time) AS hours,
COUNT (*)
FROM stream
WHERE country = 'ES'
GROUP BY 1
ORDER BY 2 DESC;

In [ ]:
# The stream table and the chat table share a column: device_id
SELECT *
FROM stream
JOIN chat
  ON stream.device_id = chat.device_id